[
  {
    "chunkId": "P1-01",
    "summary": "The novella opens aboard the Nellie, a cruising yawl anchored on the Thames at sunset. Five men wait for the tide to turn: the Director of Companies (their captain and host), the Lawyer, the Accountant, an unnamed Narrator, and Marlow. The unnamed Narrator describes the scene — the luminous estuary, barges on the tide, the brooding gloom over London. He reflects on the history of the Thames, the ships and adventurers it has borne. As darkness falls, Marlow suddenly says: 'And this also has been one of the dark places of the earth.' The Narrator characterises Marlow as unlike typical seamen — a wanderer who sees meaning not in the kernel of an episode but in the haze around it. This is the frame narrative that contains Marlow's entire story."
  },
  {
    "chunkId": "P1-02",
    "summary": "Marlow elaborates on his remark about darkness, imagining a Roman commander or young citizen arriving in ancient Britain and encountering cold, fog, disease, savagery, and the fascination of the abomination. He distinguishes conquest from colonisation, noting that what redeems conquest is only 'the idea' behind it. After a pause, Marlow says he once turned freshwater sailor and begins his personal narrative. He explains he had recently returned from years in Eastern seas and was restless in London. He had always been fascinated by blank spaces on maps, especially the great river in Africa — 'an immense snake uncoiled.' He decided to get a job as a steamboat captain for a Continental trading company operating on that river."
  },
  {
    "chunkId": "P1-03",
    "summary": "Marlow describes how his aunt (referred to as a 'dear enthusiastic soul') used her connections to secure him an appointment as captain of a river steamboat. The previous captain, Fresleven — a Dane — had been killed in a quarrel with natives over two black hens. Marlow travels to the Continental city he calls a 'whited sepulchre' (Brussels) to sign his contract at the Company's offices. In the outer room, two women knit black wool — the younger one introduces visitors, the older one with silver-rimmed spectacles scrutinises them with unconcerned wisdom. Marlow likens them to guardians of the door of Darkness. He is ushered in to the great man, who murmurs 'Bon Voyage.' A secretary makes him sign documents. Marlow then visits the Company doctor, an unshaven little man who measures his head for science and asks about madness in his family. The doctor warns him to keep calm in the tropics. Marlow visits his aunt for a farewell cup of tea; she talks of weaning ignorant millions from their horrid ways. Marlow feels like an impostor as he departs."
  },
  {
    "chunkId": "P1-04",
    "summary": "Marlow sails on a French steamer along the African coast. The coast is monotonous, featureless, with a dark-green jungle fringed by white surf. The steamer stops at ports with 'farcical names' like Gran' Bassam and Little Popo, landing soldiers and custom-house clerks. Marlow describes the oily, languid sea and the oppressive sense of unreality. He finds comfort in glimpses of native boats — the Black rowers have a wild vitality that feels natural and true. He sees a French man-of-war anchored and firing into the continent at an invisible enemy camp — an image of insane futility. The men aboard the warship die of fever at three per day. The journey takes over thirty days before Marlow reaches the mouth of the great river. He transfers to a little sea-going steamer captained by a young, morose Swede who mentions that a fellow Swede hanged himself on the road upcountry."
  },
  {
    "chunkId": "P1-05",
    "summary": "Marlow arrives at the Company's Outer Station. He sees a rocky cliff, mounds of turned-up earth, barrack-like structures, and the noise of rapids. Objectless blasting goes on — a railway cliff is being blown up for no apparent reason. Marlow encounters a chain gang of six Black men with iron collars linked by a chain, guarded by a 'reclaimed' native with a rifle. He turns away from this and descends toward a grove of trees. There he finds the 'grove of death' — Black labourers who have been worked to exhaustion and have crawled there to die. They sit and lie in every posture of pain and despair. One young man with a bit of white worsted around his neck looks up at Marlow with vacant, sunken eyes. Marlow offers him a ship's biscuit. Horrified, Marlow hurries toward the station buildings. The Swedish Captain had previously deposited Marlow and departed, commenting on the Outer Station with contempt."
  },
  {
    "chunkId": "P1-06",
    "summary": "Near the station buildings, Marlow meets the Company's Chief Accountant — a man in immaculate white clothes: starched collar, white cuffs, snowy trousers, varnished boots. His appearance is astonishing in the midst of the chaos. Marlow respects his backbone in maintaining this get-up for nearly three years. The Accountant keeps flawless books despite the heat, flies, and a sick agent groaning in his office. During Marlow's ten-day wait, the Accountant mentions Mr. Kurtz — a first-class agent in the true ivory-country who sends in more ivory than all the others combined. He calls Kurtz 'a very remarkable person' who will go far in the Company. He asks Marlow to tell Kurtz that everything at the station is satisfactory. A caravan arrives with great commotion. The sick agent dies. The accountant complains about the noise disrupting his entries. Marlow observes the grove of death visible below the office doorstep."
  },
  {
    "chunkId": "P1-07",
    "summary": "Marlow departs the Outer Station with a caravan of sixty men for a two-hundred-mile overland trek to the Central Station. The journey takes fifteen days through empty land — paths through long grass, burnt grass, thickets, stony hills ablaze with heat. The population has cleared out. Marlow passes abandoned villages. Carriers die in harness; one lies by the path with an empty water-gourd. At night, distant drums tremble on the air. He encounters a drunken white man with an armed escort who claims to be maintaining the road, though there is no visible road or upkeep. Marlow finds a middle-aged dead man with a bullet hole in his forehead. He has a white travelling companion who keeps fainting and eventually catches fever and must be carried in a hammock, causing problems with the carriers."
  },
  {
    "chunkId": "P1-08",
    "summary": "Marlow arrives at the Central Station — a back-water settlement surrounded by scrub and forest, enclosed by a crazy fence of rushes. A stout, excitable man with black moustaches informs him that his steamer has been sunk — it was taken upriver by a volunteer skipper and tore its bottom on rocks. Marlow meets the Manager, a man of middle size with remarkably cold blue eyes. The Manager inspires uneasiness rather than respect; he has no genius but survives through unbreakable health. He tells Marlow the situation is 'very grave' — an important station is in jeopardy and its chief, Mr. Kurtz, is reportedly ill. The Manager estimates it will take three months to repair the steamer. Marlow begins the work. He describes the station as pervaded by the word 'ivory' and staffed by aimless pilgrims carrying long staves. The agents intrigue and slander each other in the hope of getting trading-posts where ivory is available."
  },
  {
    "chunkId": "P1-09",
    "summary": "One evening a grass shed full of calico and beads catches fire. A stout man with moustaches runs down with a leaky pail. In the aftermath, Marlow is approached by the brickmaker — a first-class agent who produces no bricks. The brickmaker's room contains a silver dressing-case, a whole candle (a luxury only the Manager supposedly has), and native-mat walls hung with weapons. He tries to pump Marlow about his connections in Europe. Marlow notices a small oil painting on a panel: a blindfolded woman carrying a lighted torch against a dark background, painted by Kurtz at this station more than a year ago. The brickmaker reveals Kurtz is 'chief of the Inner Station,' a prodigy and 'emissary of pity and science and progress' who is destined to rise in the Company. He believes Marlow is part of 'the new gang — the gang of virtue' sent by the same powers that back Kurtz. Marlow nearly lets the brickmaker believe this, sensing it might somehow help Kurtz. Outside, the beaten man groans. The brickmaker's veiled threat about Kurtz not having a charmed life is noted."
  },
  {
    "chunkId": "P1-10",
    "summary": "Marlow desperately needs rivets to repair the steamer. There are plenty at the coast but none arrive at the Central Station. He tells the boilermaker — a lank, bony widower with six children and a passion for pigeon-flying — that rivets are coming. They celebrate with a wild jig on the iron deck. But instead of rivets, the Eldorado Exploring Expedition arrives in five instalments, each section headed by a donkey carrying a white man. They bring tents, camp-stools, tin boxes, but no rivets. The expedition is led by the Manager's uncle, who resembles a butcher — fat, with sleepy cunning. He speaks to no one but his nephew the Manager. Marlow describes the expedition as sordid buccaneers: reckless without hardihood, greedy without audacity, cruel without courage. Marlow gives up on the rivets and occasionally thinks about Kurtz, curious to see whether this man equipped with moral ideas will succeed."
  },
  {
    "chunkId": "P2-01",
    "summary": "Part II opens with Marlow lying on the deck of his steamboat at the Central Station. He overhears the Manager (the nephew) and his uncle strolling along the bank, discussing Kurtz. The Manager resents being ordered to send Kurtz to the Inner Station and finds his influence frightful. They discuss how Kurtz sent his assistant down the river with ivory, then turned back alone in a small dugout — a puzzling act. The uncle suggests the climate may 'do away with this difficulty.' They also mention a wandering trader snapping ivory from the natives. The uncle extends his arm toward the forest as if trusting the wilderness to kill Kurtz for them. Marlow leaps up, startled by this gesture. The two men notice and pretend they didn't know he was there. Days later, the Eldorado Expedition disappears into the wilderness; all the donkeys die and the expedition is never heard from again. The steamer is finally ready. Marlow departs upriver, excited at the prospect of meeting Kurtz."
  },
  {
    "chunkId": "P2-02",
    "summary": "The steamer crawls upriver for two months through primeval forest. Marlow describes the journey as travelling back to the earliest beginnings of the world — empty streams, great silence, impenetrable forest, warm sluggish air. He navigates snags and hidden banks while the Manager and three or four pilgrims ride along with their staves. The cannibal crew of about thirty men (enlisted along the way) has had their hippo-meat rations thrown overboard by the pilgrims, who couldn't stand the smell. Marlow reflects on the cannibals' restraint in not eating the whites despite their starvation. He describes the helmsman — an athletic Black man from a coast tribe, unstable and panicky without supervision. The fireman, an 'improved specimen' who fears the boiler spirit, tends the steam gauge. Drums echo at night. They pass villages where people emerge in frenzied displays. Marlow muses on the unsettling connection between modern and primitive humanity. A listener on the Nellie growls 'Try to be civil, Marlow.'"
  },
  {
    "chunkId": "P2-03",
    "summary": "About fifty miles below the Inner Station, the steamer comes upon a hut of reeds with a melancholy flag-pole and a neatly stacked wood-pile. A faded pencil-note on a board reads: 'Wood for you. Hurry up. Approach cautiously.' The signature is illegible but not Kurtz's — a much longer word. Inside the hut, which has been abandoned, Marlow finds a torn red curtain and a book: 'An Inquiry into some Points of Seamanship' by Towson or Towser. The book is sixty years old but lovingly re-stitched with white cotton thread. Its margins are filled with pencilled notes that appear to be in cipher. Marlow pockets the book. The Manager suspects a wandering English trader — an intruder. Marlow remarks that no man is safe from trouble. They load the firewood and continue upriver. The current grows stronger and the steamer labours. Marlow debates with himself about whether to speak openly with Kurtz."
  },
  {
    "chunkId": "P2-04",
    "summary": "About eight miles from Kurtz's station, the Manager insists they anchor for the night because the navigation ahead is dangerous. The reach is narrow and straight with high sides. Night falls; not a sound is heard. At about three in the morning a fish leaps loudly. At dawn, a warm white fog descends, blinding and solid. When the chain is paid out, a very loud cry of infinite desolation soars through the fog, followed by a savage clamour. The pilgrims panic; two rush for their Winchesters. The headman of the cannibals says 'Catch 'im. Give 'im to us... Eat 'im!' Marlow reflects at length on the cannibals' restraint — they have been starving for a month, paid in brass wire they cannot use. Two pilgrims argue about which bank to head for. The Manager says he would be desolated if anything happened to Kurtz, though Marlow doubts his sincerity. Marlow refuses to move in the fog, knowing they would run aground. He believes the cries express sorrow, not hostility — the steamboat's appearance has filled the unseen people with unrestrained grief."
  },
  {
    "chunkId": "P2-05",
    "summary": "About two hours after the fog lifts, the steamer approaches the Inner Station. Marlow sees a chain of shallow patches in mid-river and takes the western passage. The channel is narrower than expected, with a high, overgrown bank on the right. Arrows begin flying from the bush. The poleman drops flat; the fireman ducks. Marlow sees sticks whizzing past before he realises they are arrows. He steps to close the shutter but the helmsman panics, opens the other shutter, and fires the Martini-Henry rifle. The pilgrims below open fire from the hip with Winchesters, filling the air with smoke. A spear comes through the open shutter and kills the helmsman, catching him in the side below the ribs. Marlow pulls the steam whistle cord repeatedly, sending shrieking blasts that cause the attackers to flee. The helmsman dies at Marlow's feet, his blood filling Marlow's shoes. The pilgrim in pink pyjamas arrives and sees the dead man. Marlow assumes Kurtz must be dead too and feels extreme disappointment at never hearing him speak."
  },
  {
    "chunkId": "P2-06",
    "summary": "Marlow removes his blood-soaked shoes and throws them overboard. He reflects on Kurtz as a voice — the gift of expression. He flings the other shoe as well. The pilgrim in pink pyjamas takes the wheel. Marlow drags the helmsman's body out and tips it overboard to prevent the cannibals from eating it, which scandalises the pilgrims but satisfies Marlow's sense of practicality. He mourns the helmsman as a partner forged over months of shared work. Marlow then gives a long digression: Kurtz was half-English, half-French, educated partly in England. All Europe contributed to his making. The International Society for the Suppression of Savage Customs had commissioned him to write a report. The report was eloquent — seventeen pages arguing that whites appear as supernatural beings to natives. But at the foot of the last page, scrawled later in an unsteady hand: 'Exterminate all the brutes!' Kurtz later forgot about this postscriptum and asked Marlow to safeguard 'my pamphlet.' The red-haired pilgrim dances with bloodlust. Marlow points out they made mostly smoke. Then the Manager spots the Inner Station ahead."
  },
  {
    "chunkId": "P2-07",
    "summary": "Through his binoculars, Marlow sees a decaying building on a hill, slim posts with round carved tops forming a line, and a white man on shore beckoning. The man looks like a harlequin — his brown clothes are covered with bright patches of blue, red, and yellow. He warns of a snag. The Manager and armed pilgrims go to the house. The harlequin comes aboard and tells Marlow the natives 'are simple people' and he had to keep them off. He reveals himself as a Russian, son of an arch-priest from the Government of Tambov. He ran away from school, went to sea, got outfitted by a Dutch trader named Van Shuyten, and has been wandering the river alone for two years. It was he who left the firewood and the book downstream. Marlow returns the book — 'Towson's Inquiry' — and the Russian is overjoyed; the 'cipher' in the margins was Russian. He explains the natives attacked the steamer because 'they don't want him to go' — referring to Kurtz. The Russian declares: 'This man has enlarged my mind.'"
  },
  {
    "chunkId": "P3-01",
    "summary": "Part III opens with Marlow marvelling at the Russian's improbable survival. The Russian describes how Kurtz talked for entire nights about everything — love, life — and 'made me see things.' He nursed Kurtz through two illnesses. Kurtz often wandered alone deep in the forest, raiding villages for ivory with tribal warriors who adored him. Kurtz once threatened to shoot the Russian over a small lot of ivory, but the Russian stayed, unable to leave. Looking through binoculars at the house, Marlow makes a startling discovery: the round knobs on the fence posts are not ornamental — they are human heads on stakes, all facing the house except one facing the river. The Russian is crestfallen and explains these were the heads of 'rebels.' The Manager later said Kurtz's methods had ruined the district. Marlow reflects that Kurtz lacked restraint — the wilderness found him out because he was hollow at the core. The Russian breaks down, saying Kurtz has been shamefully abandoned without medicine or food."
  },
  {
    "chunkId": "P3-02",
    "summary": "As shadows lengthen, a group of men appears carrying an improvised stretcher. A piercing cry splits the air, and streams of armed native warriors pour from the forest into the clearing. The Russian says if Kurtz doesn't say the right thing, they are all done for. Kurtz sits up on the stretcher, skeletal and commanding. Marlow sees him through binoculars — at least seven feet tall, his covering fallen off, the cage of his ribs visible. Kurtz opens his mouth wide and appears to shout a command. The crowd of warriors melts back into the forest. Meanwhile, a stately African woman adorned with brass leggings, gauntlets, innumerable glass-bead necklaces, and various charms walks deliberately to the riverbank. She carries her head high; her hair is helmet-shaped. She faces the steamer, stands still for a full minute, then opens her arms rigidly above her head. She turns and passes into the bushes. The Russian says he has spent a fortnight trying to keep her out of the house; she once berated Kurtz for an hour while pointing at the Russian. Kurtz is carried into the cabin of the steamer, where he is given his correspondence and letters. He speaks his first direct words to Marlow: 'I am glad,' marking their first personal interaction after the long journey upriver."
  },
  {
    "chunkId": "P3-03",
    "summary": "Kurtz is heard from behind the curtain: 'Save me! — save the ivory, you mean... I'll carry my ideas out yet — I will return.' The Manager takes Marlow aside and says Kurtz's methods are unsound and have harmed trade. Marlow responds 'No method at all,' which the Manager takes as agreement but is really a deeper condemnation. The Manager now views Marlow as allied with Kurtz — 'unsound method.' The Russian approaches Marlow, worried about Kurtz's reputation. Marlow tells him the Manager thinks the Russian should be hanged. The Russian decides to slip away. He reveals the crucial fact: it was Kurtz who ordered the attack on the steamer, hoping to scare them off so he wouldn't be taken away. Marlow promises discretion. The Russian departs at night with Martini-Henry cartridges, tobacco, an old pair of Marlow's shoes, and his beloved book. He vanishes into the darkness, saying 'He enlarged my mind!'"
  },
  {
    "chunkId": "P3-04",
    "summary": "Marlow wakes shortly after midnight. A fire burns on the hill. The monotonous beating of a drum and chanting come from the forest where Kurtz's adorers keep vigil. Marlow glances into Kurtz's cabin — it is empty. He does not raise an alarm, choosing to deal with Kurtz alone. He finds a trail through the grass and tracks Kurtz, who has crawled from the steamer toward the tribal fires. Marlow catches up to him about thirty yards from the nearest fire. Kurtz, unsteady on his feet, tells Marlow to go away. A witch-man with antelope horns stands silhouetted against the flames. Marlow realises he cannot appeal to Kurtz in the name of anything high or low — Kurtz has 'kicked himself loose of the earth.' Instead, Marlow appeals to his ambition, assuring him his success in Europe is assured. Kurtz speaks of immense plans, the threshold of great things. His intelligence is clear but his soul is mad. Marlow supports Kurtz back to the steamer, carrying him like a child."
  },
  {
    "chunkId": "P3-05",
    "summary": "The next day at noon, the steamer departs. The crowd flows out of the forest — two thousand pairs of eyes watch the departure. Three men plastered with red earth strut along the bank, stamping and shaking feathers. The deep murmurs of the crowd sound like a satanic litany. Kurtz lies on a couch in the pilot-house, staring through the open shutter. The African woman rushes to the water's edge and puts out her hands, shouting. The whole mob takes up the shout in a roaring chorus. Marlow asks Kurtz if he understands; Kurtz says 'Do I not?' with fiery, longing eyes. Marlow blasts the steam whistle to prevent the pilgrims from firing into the crowd. The people scatter in terror. The three red-painted men fall flat. But the African woman does not flinch — she stretches her bare arms tragically after the departing steamer."
  },
  {
    "chunkId": "P3-06",
    "summary": "The brown current carries the steamer swiftly downstream. Kurtz's life ebbs. The Manager is placid, considering the affair well concluded. Marlow is now numbered among the dead as a partisan of 'unsound method.' Kurtz discourses on his plans, his Intended, his career, his ideas, his ivory. He says 'My ivory... my station, my river.' Marlow reflects that Kurtz was 'spoiled and pampered' by the wilderness. The steamboat breaks down and must lie up for repairs. Kurtz gives Marlow a packet of papers and a photograph for safekeeping, warning that 'this noxious fool' (the Manager) will pry. One evening Kurtz mutters 'Live rightly, die, die...' One evening by candlelight, Kurtz says 'I am lying here in the dark waiting for death.' Then his face changes — an expression of sombre pride, ruthless power, craven terror, and hopeless despair. He cries out: 'The horror! The horror!' Marlow blows the candle out and goes to the mess-room. The Manager's boy announces: 'Mistah Kurtz — he dead.' The pilgrims rush out; Marlow stays and finishes his dinner. Kurtz is buried in a muddy hole the next day."
  },
  {
    "chunkId": "P3-07",
    "summary": "Marlow himself nearly dies. He says 'they very nearly buried me' but recovered. He returns to the sepulchral city (Brussels) and resents the complacent, ignorant populace. He has Kurtz's papers — a packet of letters and the girl's portrait. A clean-shaved Company representative with gold-rimmed spectacles demands Kurtz's documents, claiming the Company's right. Marlow gives him only the report on the Suppression of Savage Customs, with the 'Exterminate all the brutes!' postscriptum torn off. The man sniffs at it and departs. Kurtz's cousin, an organist with lank grey hair, appears and claims Kurtz was essentially a great musician. He takes some family letters. A journalist with bristly hair and an eyeglass says Kurtz's proper sphere was politics, that he could 'electrify large meetings' and would have led any extreme party. He takes the famous Report. Marlow is left with the personal letters and the Intended's portrait. He learns Kurtz's mother has died, watched over by his Intended. Marlow decides to deliver the portrait and letters personally."
  },
  {
    "chunkId": "P3-08",
    "summary": "Marlow visits Kurtz's Intended at her home in the sepulchral city, more than a year after Kurtz's death. He enters a lofty drawing-room with three tall windows, gilt furniture, a marble fireplace, and a grand piano. She comes forward in black mourning. She is not very young, with a mature capacity for fidelity and suffering. She takes Marlow's hands and says she heard he was coming. Marlow gives her the packet. She speaks of Kurtz's nobility, his goodness, his vast plans. She says she knew him best and felt worthy of him. As the darkness deepens, Marlow feels the presence of Kurtz's shade — the stretcher, the crowd, the forest gloom. The Intended asks Marlow to repeat Kurtz's last words. She insists: 'I want something to live with.' Marlow is on the point of saying 'The horror!' but cannot do it. He lies: 'The last word he pronounced was — your name.' She cries out in triumph and pain, believing she always knew this. Marlow reflects that the heavens do not fall for such a trifle. He could not tell her the truth — 'it would have been too dark altogether.'"
  },
  {
    "chunkId": "P3-09",
    "summary": "Marlow ceases speaking. He sits apart on the Nellie, indistinct and silent, in the pose of a meditating Buddha. Nobody moves. The Director of Companies says 'We have lost the first of the ebb.' The unnamed Narrator raises his head and looks out. The offing is barred by a black bank of clouds. The tranquil waterway leading to the uttermost ends of the earth flows sombre under an overcast sky — seeming to lead into the heart of an immense darkness. This final paragraph mirrors and inverts the opening, replacing the luminous sunset with oppressive gloom, and completing the frame narrative."
  }
]
